## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                 |
|--------|--------------------------------------|
| add    | `aws_amplify_app.design_system_docs` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_app.design_system_docs will be created
  + resource "aws_amplify_app" "design_system_docs" {
      + access_token      = (sensitive value)
      + arn               = (known after apply)
      + build_spec        = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm install
                build:
                  commands:
                    - npm run build
              artifacts:
                # IMPORTANT - Please verify your build output directory
                baseDirectory: _site/
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "Design System"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + repository        = "https://github.com/cds-snc/gcds-docs"
      + tags_all          = (known after apply)

      + auto_branch_creation_config {
          + enable_auto_build             = true
          + enable_pull_request_preview   = true
          + pull_request_environment_name = "rc"
          + stage                         = "PRODUCTION"
        }

      + custom_rule {
          + source = "/<*>"
          + status = "404"
          + target = "/index.html"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
